package bg.bulsi.mvr.audit_logger.model;

public enum AuditEventType {
	//CREATE_EIDENTITY(request_message_cyrillic, success_message_cyrillic, fail_message_cyrillic)
	CREATE_EIDENTITY("Заявка за създаване на електронна идентичност", "Успешно създаване на електронна идентичност", "Неуспешно създаване на електронна идентичност", true),
	UPDATE_EIDENTITY("Заявка за обновяване на електронна идентичност", "Успешно обновяване на електронна идентичност", "Неуспешно обновяване на електронна идентичност", true),
	UPDATE_EIDENTITY_ACTIVE("Заявка за активиране на електронна идентичност", "Успешно активиране на електронна идентичност", "Неуспешно активиране на електронна идентичност", true),
	FIND_EIDENTITIES_BY_FILTER("Заявка за търсене на електронни идентичности по филтър", "Успешно търсене на електронни идентичности по филтър", "Неуспешно търсене на електронни идентичности по филтър", true),
	GET_EIDENTITY_BY_ID("Заявка за извличане на електронна идентичност по ID", "Успешно извличане на електронна идентичност по ID", "Неуспешно извличане на електронна идентичност по ID", true),
//	CREATE_CITIZEN("Заявка за създаване на гражданин", "Успешно създаване на гражданин", "Неуспешно създаване на гражданин", true),
	UPDATE_CITIZEN("Заявка за обновяване на данни за гражданин", "Успешно обновяване на данни за гражданин", "Неуспешно обновяване на данни за гражданин", true),
	GET_CITIZEN_BY_ID("Заявка за извличане на данни за гражданин по ID", "Успешно извличане на данни за гражданин по ID", "Неуспешно извличане на данни за гражданин по ID", true),
	CREATE_CITIZEN_CERTIFICATE("Заявка за създаване на Удостоверение за електронна идентичност за гражданин", "Успешно създаване на Удостоверение за електронна идентичност за гражданин", "Неуспешно създаване на Удостоверение за електронна идентичност за гражданин", true),
	GET_CITIZEN_CERTIFICATE_BY_SN_AND_ISSUER("Заявка за извличане на Удостоверение за електронна идентичност за гражданин по сериен номер и издател", "Успешно извличане на Удостоверение за електронна идентичност за гражданин по сериен номер и издател", "Неуспешно извличане на Удостоверение за електронна идентичност за гражданин по сериен номер и издател", true),
	GET_CITIZEN_CERTIFICATE_BY_ID("Заявка за извличане на Удостоверение за електронна идентичност за гражданин по ID", "Успешно извличане на Удостоверение за електронна идентичност за гражданин по ID", "Неуспешно извличане на Удостоверение за електронна идентичност за гражданин по ID", true),
	UPDATE_CITIZEN_CERTIFICATE_STATUS("Заявка за обновяване на статус на Удостоверение за електронна идентичност за гражданин", "Успешно обновяване на статус на Удостоверение за електронна идентичност за гражданин", "Неуспешно обновяване на статус на Удостоверение за електронна идентичност за гражданин", true),
	FIND_CITIZEN_CERTIFICATES("Заявка за търсене на Удостоверение за електронна идентичности за гражданин", "Успешно търсене на Удостоверение за електронна идентичности за гражданин", "Неуспешно търсене на Удостоверение за електронна идентичности за гражданин", true),
	VALIDATE_CITIZEN_CERTIFICATE("Заявка за валидация на Удостоверение за електронна идентичност за гражданин", "Успешна валидация на Удостоверение за електронна идентичност за гражданин", "Неуспешна валидация на Удостоверение за електронна идентичност за гражданин", true),
	GET_CITIZEN_BY_EIDENTITY_ID("Заявка за извличане на гражданин по ID на електронна идентичност", "Успешно извличане на гражданин по ID на електронна идентичност", "Неуспешно извличане на гражданин по ID на електронна идентичност", true),
	UPDATE_CITIZEN_PROFILE("Заявка за обновяване на профил на гражданин", "Успешно обновяване на профил на гражданин", "Неуспешно обновяване на профил на гражданин", true),
	GET_CITIZEN_PROFILE_BY_EIDENTITY_ID("Заявка за извличане на профил на гражданин по ID на електронна идентичност", "Успешно извличане на профил на гражданин по ID на електронна идентичност", "Неуспешно извличане на профил на гражданин по ID на електронна идентичност", true),
	CREATE_CITIZEN_PROFILE("Заявка за създаване на профил на гражданин", "Успешно създаване на профил на гражданин", "Неуспешно създаване на профил на гражданин", true),
	VERIFY_CITIZEN_PROFILE("Заявка за верификация на профил на гражданин", "Успешна верификация на профил на гражданин", "Неуспешна верификация на профил на гражданин", true),
	FORGOT_CITIZEN_PROFILE_PASSWORD("Заявка за забравена парола за профил на гражданин", "Успешно изпълнена заявка за забравена парола за профил на гражданин", "Неуспешно изпълнена заявка за забравена парола за профил на гражданин", true),
	REGISTER_CITIZEN("Заявка за регистрация на гражданин", "Успешна регистрация на гражданин", "Неуспешна регистрация на гражданин", true),
	VERIFY_REGISTERED_CITIZEN("Заявка за верификация на регистриран гражданин", "Успешна верификация на регистриран гражданин", "Неуспешна верификация на регистриран гражданин", true),
	GET_CITZEN_PROFILE("Заявка за получаване на профил на гражданин", "Успешно получаване на профил на гражданин", "Неуспешно получаване на профил на гражданин", true),
	UPDATE_CITIZEN_PROFILE_EIDENTITY("Заявка за обновяване на профил на гражданин с електронна идентичност", "Успешно обновяване на профил на гражданин с електронна идентичност", "Неуспешно обновяване на профил на гражданин с електронна идентичност", true),
	FORGOT_CITIZEN_PASSWORD("Заявка за забравена парола за гражданин", "Успешно изпълнена заявка за забравена парола за гражданин", "Неуспешно изпълнена заявка за забравена парола за гражданин", true),
	GET_RESET_CITIZEN_PASSWORD("Заявка за получаване на данни за нулиране на парола", "Успешно получаване на данни за нулиране на парола", "Неуспешно получаване на данни за нулиране на парола", true),
	POST_RESET_CITIZEN_PASSWORD("Заявка за задаване на нова парола", "Успешно задаване на нова парола", "Неуспешно задаване на нова парола", true),
	UPDATE_CITIZEN_PASSWORD("Заявка за обновяване на парола на гражданин", "Успешно обновяване на парола на гражданин", "Неуспешно обновяване на парола на гражданин", true),

	CREATE_ISSUE_APPLICATION("Заявление за издаване на удостоверение", "Успешно заявление за издаване на удостоверение", "Неуспешно заявление за издаване на удостоверение", true),
	CREATE_EXT_ISSUE_APPLICATION("Заявление за издаване на удостоверение", "Успешно подадено заявление за издаване на удостоверение", "Неуспешно подадено заявление за издаване на удостоверение", true),
	CREATE_RESUME_APPLICATION("Заявление за възобновяване на удостоверение", "Успешно заявление за възобновяване на удостоверение", "Неуспешно заявление за възобновяване на удостоверение", true),
	CREATE_STOP_APPLICATION("Заявка за спиране на удостоверение", "Успешно спиране на удостоверение", "Неуспешно спиране на удостоверение", true),
	CREATE_REVOKE_APPLICATION("Заявка за прекратяване на удостоверение", "Успешно прекратяване на удостоверение", "Неуспешно прекратяване на удостоверение", true),
	FIND_APPLICATION_BY_FILTER("Заявка за търсене на заявления по филтър", "Успешно търсене на заявления по филтър", "Неуспешно търсене на заявления по филтър", true),
	FIND_EXT_APPLICATION_BY_FILTER("Заявка за търсене на заявления по филтър", "Успешно търсене на заявления по филтър", "Неуспешно търсене на заявления по филтър", true),

	CREATE_ISSUE_ONLINE_APPLICATION("Заявка за Онлайн заявление за издаване на удостоверение", "Успешно подадено Онлайн заявление за издаване на удостоверение", "Неуспешно подадено Онлайн заявление за издаване на удостоверение", true),
	CREATE_RESUME_ONLINE_APPLICATION("Заявка за Онлайн заявление за възобновяване на удостоверение", "Успешно Онлайн заявление за възобновяване на удостоверение", "Неуспешно Онлайн заявление за възобновяване на удостоверение", true),
	CREATE_STOP_ONLINE_APPLICATION("Заявка за Онлайн заявление за спиране на удостоверение", "Успешно подадено Онлайн заявление за спиране на удостоверение", "Неуспешно подадено Онлайн заявление за спиране на удостоверение", true),
	CREATE_REVOKE_ONLINE_APPLICATION("Заявка за Онлайн заявление за прекратяване на удостоверение", "Успешно подадено Онлайн заявление за прекратяване на удостоверение", "Неуспешно подадено Онлайн заявление за прекратяване на удостоверение", true),

	SIGN_APPLICATION("Заявка за подписване на заявление", "Успешно подписване на заявление", "Неуспешно подписване на заявление", true),
	EXPORT_APPLICATION("Заявка за експортиране на заявление", "Успешно експортиране на заявление", "Неуспешно експортиране на заявление", true),
	GET_APPLICATIONS_BY_EIDENTITY_ID("Заявка за извличане на заявления по ID на електронна идентичност", "Успешно извличане на заявления по ID на електронна идентичност", "Неуспешно извличане на заявления по ID на електронна идентичност", true),
	GET_APPLICATIONS_ADMIN("Заявка за извличане на администраторски заявления", "Успешно извличане на администраторски заявления", "Неуспешно извличане на администраторски заявления", true),
	GET_APPLICATIONS_BY_ID("Заявка за извличане на заявление по ID", "Успешно извличане на заявление по ID", "Неуспешно извличане на заявление по ID", true),
	GET_EID_ISSUER_BY_EID_ADMINISTRATOR_ID("Заявка за получаване на издател по ID на администратор", "Успешно получаване на издател по ID на администратор", "Неуспешно получаване на издател по ID на администратор", true),
	GET_ALL_REASONS("Заявка за получаване на всички причини", "Успешно получаване на всички причини", "Неуспешно получаване на всички причини", false),
	GET_CERTIFICATE_HISTORY("Заявка за получаване на история на Удостоверение за електронна идентичност", "Успешно получаване на история на Удостоверение за електронна идентичност", "Неуспешно получаване на история на Удостоверение за електронна идентичност", true),
	GENERATE_APPLICATION_SIGNATURE("Заявка за генериране на подпис на заявление", "Успешно генериране на подпис на заявление", "Неуспешно генериране на подпис на заявление", true),
	DENY_APPLICATION("Заявка за отказване на заявление", "Успешно отказване на заявление", "Неуспешно отказване на заявление", true),
	COMPLETE_ISSUE_EID("Заявка за завършване на издаването на електронна идентичност", "Успешно завършване на издаването на електронна идентичност", "Неуспешно завършване на издаването на електронна идентичност", true),
	COMPLETE_ONLINE_APPLICATION("Заявка за промяна на статус на удостоверение за електронна идентичност", "Успешно промяна на статус на удостоверение за електронна идентичност", "Неуспешна промяна на статус на удостоверение за електронна идентичност", true),
	CONFIRM_PERSO_APPLICATION("Заявка за потвърждаване на заявление, подадено чрез Персонализационния център", "Успешно потвърждаване на заявление, подадено чрез Персонализационния център", "Неуспешно потвърждаване на заявление, подадено чрез Персонализационния център", true),
	CREATE_PERSO_APPLICATION("Заявка за създаване на заявление от Персонализационния центъра", "Успешно създаване на заявление от Персонализационния центъра", "Неуспешно създаване на заявление от Персонализационния центъра", true),
	CONFIRM_MOBILE_APPLICATION("Заявка за потвърждаване на мобилно заявление", "Успешно потвърждаване на мобилно заявление", "Неуспешно потвърждаване на мобилно заявление", true),
	CONFIRM_DESK_APPLICATION("Заявка за потвърждаване на заявление, подадено на гише", "Успешно потвърждаване на заявление, подадено на гише", "Неуспешно потвърждаване на заявление, подадено на гише", true),
	ADD_GUARDIANS_TO_APPLICATION("Заявка за добавяне на настойници към заявление", "Успешно добавяне на настойници към заявление", "Неуспешно добавяне на настойници към заявление", true),
	CREATE_CERT_STATUS_ONLINE_APPLICATION("Заявка за създаване на онлайн заявление за статус на Удостоверение за електронна идентичност", "Успешно създаване на онлайн заявление за статус на Удостоверение за електронна идентичност", "Неуспешно създаване на онлайн заявление за статус на Удостоверение за електронна идентичност", true),
	GET_EID_ADMINISTRATOR_BY_ID("Заявка за извличане на администратор по ID", "Успешно извличане на администратор по ID", "Неуспешно извличане на администратор по ID", true),
	GET_FULL_EID_ADMINISTRATOR_BY_ID("Заявка за извличане на администратор по ID", "Успешно извличане на администратор по ID", "Неуспешно извличане на администратор по ID", true),
	GET_EID_ADMINISTRATOR_WITH_AUTHORIZED_PERSONS_BY_ID("Заявка за извличане на администратор по ID", "Успешно извличане на администратор по ID", "Неуспешно извличане на администратор по ID", true),
	GET_EID_CENTER_WITH_AUTHORIZED_PERSONS_BY_ID("Заявка за извличане на център по ID", "Успешно извличане на център по ID", "Неуспешно извличане на център по ID", true),
	GET_ALL_EID_ADMINISTRATORS("Заявка за извличане на всички администратори", "Успешно извличане на всички администратори", "Неуспешно извличане на всички администратори", true),
	GET_ALL_EID_ADMINISTRATORS_HISTORY("Заявка за извличане на всички администратори", "Успешно извличане на всички администратори", "Неуспешно извличане на всички администратори", true),
	CREATE_EID_ADMINISTRATOR("Заявка за създаване на администратор", "Успешно създаване на администратор", "Неуспешно създаване на администратор", true),
	UPDATE_EID_ADMINISTRATOR("Заявка за обновяване на данни за администратор", "Успешно обновяване на данни за администратор", "Неуспешно обновяване на данни за администратор", true),
	GET_EID_CENTER_BY_ID("Заявка за извличане на център за електронна идентичност по ID", "Успешно извличане на център за електронна идентичност по ID", "Неуспешно извличане на център за електронна идентичност по ID", true),
	GET_FULL_EID_CENTER_BY_ID("Заявка за извличане на център за електронна идентичност по ID", "Успешно извличане на център за електронна идентичност по ID", "Неуспешно извличане на център за електронна идентичност по ID", true),
	GET_DOCUMENTS_NOTES_FOR_APPLICATION("Заявка за извличане на документи и бележки за заявление", "Успешно извличане на документи и бележки за заявление", "Неуспешно извличане на документи и бележки за заявление", true),
	GET_DOCUMENTS_NOTES_FOR_EID_MANAGER("Заявка за извличане на документи и бележки за мениджър", "Успешно извличане на документи и бележки за мениджър", "Неуспешно извличане на документи и бележки за мениджър", true),
	GET_ALL_EID_CENTERS("Заявка за извличане на всички центрове за електронна идентичност", "Успешно извличане на всички центрове за електронна идентичност", "Неуспешно извличане на всички центрове за електронна идентичност", true),
	GET_ALL_EID_CENTERS_HISTORY("Заявка за извличане на всички центрове за електронна идентичност", "Успешно извличане на всички центрове за електронна идентичност", "Неуспешно извличане на всички центрове за електронна идентичност", true),
	CREATE_EID_CENTER("Заявка за създаване на център за електронна идентичност", "Успешно създаване на център за електронна идентичност", "Неуспешно създаване на център за електронна идентичност", true),
	UPDATE_EID_CENTER("Заявка за обновяване на център за електронна идентичност", "Успешно обновяване на център за електронна идентичност", "Неуспешно обновяване на център за електронна идентичност", true),
	GET_EID_MANAGER_FRONT_OFFICE_BY_ID("Заявка за извличане на фронт офис на мениджър по ID", "Успешно извличане на фронт офис на мениджър по ID", "Неуспешно извличане на фронт офис на мениджър по ID", true),
	GET_ALL_EID_MANAGER_FRONT_OFFICES_BY_MANAGER_ID("Заявка за извличане на всички фронт офиси на мениджъра по ID", "Успешно извличане на всички фронт офиси на мениджъра по ID", "Неуспешно извличане на всички фронт офиси на мениджъра по ID", true),
	CREATE_EID_MANAGER_FRONT_OFFICE("Заявка за създаване на фронт офис на мениджър", "Успешно създаване на фронт офис на мениджър", "Неуспешно създаване на фронт офис на мениджър", true),
	UPDATE_EID_MANAGER_FRONT_OFFICE("Заявка за обновяване на фронт офис на мениджър", "Успешно обновяване на фронт офис на мениджър", "Неуспешно обновяване на фронт офис на мениджър", true),
	DELETE_EID_MANAGER_FRONT_OFFICE("Заявка за изтриване на фронт офис на мениджър", "Успешно изтриване на фронт офис на мениджър", "Неуспешно изтриване на фронт офис на мениджър", true),
	GET_EID_MANAGER_FRONT_OFFICE_BY_NAME("Заявка за извличане на фронт офис на мениджър по име", "Успешно извличане на фронт офис на мениджър по име", "Неуспешно извличане на фронт офис на мениджър по име", true),
	GET_ALL_EID_MANAGER_OFFICES_BY_REGION("Заявка за извличане на всички офиси на мениджъра по регион", "Успешно извличане на всички офиси на мениджъра по регион", "Неуспешно извличане на всички офиси на мениджъра по регион", true),
	GET_PROVIDED_SERVICE_BY_ID("Заявка за извличане на предоставяна услуга по ID", "Успешно извличане на предоставяна услуга по ID", "Неуспешно извличане на предоставяна услуга по ID", true),
	GET_PROVIDED_SERVICE_BY_APPLICATION_TYPE("Заявка за извличане на предоставяна услуга по тип на заявление", "Успешно извличане на предоставяна услуга по тип на заявление", "Неуспешно извличане на предоставяна услуга по тип на заявление", true),
	GET_ALL_PROVIDED_SERVICE("Заявка за извличане на всички предоставяни услуги", "Успешно извличане на всички предоставяни услуги", "Неуспешно извличане на всички предоставяни услуги", true),
	CREATE_APROVIDED_SERVICE("Заявка за създаване на предоставяна услуга", "Успешно създаване на предоставяна услуга", "Неуспешно създаване на предоставяна услуга", true),
	UPDATE_PROVIDED_SERVICE("Заявка за обновяване на предоставяна услуга", "Успешно обновяване на предоставяна услуга", "Неуспешно обновяване на предоставяна услуга", true),
	DELETE_PROVIDED_SERVICE("Заявка за изтриване на предоставяна услуга", "Успешно изтриване на предоставяна услуга", "Неуспешно изтриване на предоставяна услуга", true),
	GET_AEI_DEVICES("Заявка за извличане на всички устройства на Администратор на Електронна Идентичност", "Успешно извличане на всички устройства на Администратор на Електронна Идентичност", "Неуспешно извличане на всички устройства на Администратор на Електронна Идентичност", true),
	GET_DEVICE_BY_ID("Заявка за извличане на носител по ID", "Успешно извличане на носител по ID", "Неуспешно извличане на носител по ID", true),
	GET_ALL_DEVICES("Заявка за извличане на всички устройства", "Успешно извличане на всички устройства", "Неуспешно извличане на всички устройства", true),
	GET_EXT_ALL_DEVICES("Заявка за извличане на всички устройства", "Успешно извличане на всички устройства", "Неуспешно извличане на всички устройства", true),
	CREATE_DEVICE("Заявка за създаване на носител", "Успешно създаване на носител", "Неуспешно създаване на носител", true),
	UPDATE_DEVICE("Заявка за обновяване на носител", "Успешно обновяване на носител", "Неуспешно обновяване на носител", true),
	DELETE_DEVICE("Заявка за изтриване на носител", "Успешно изтриване на носител", "Неуспешно изтриване на носител", true),
	INVALIDATE_CERTIFICATES_BY_ID_NUMBER("Заявка за анулиране на Удостоверения за електронна идентичност по идентификационен номер", "Успешно анулиране на Удостоверения за електронна идентичност по идентификационен номер", "Неуспешно анулиране на Удостоверения за електронна идентичност по идентификационен номер", true),
	INVALIDATE_CERTIFICATES_BY_DATE("Заявка за анулиране на Удостоверения за електронна идентичност по дата", "Успешно анулиране на Удостоверения за електронна идентичност по дата", "Неуспешно анулиране на Удостоверения за електронна идентичност по дата", true),
	GET_EIDENTITIES_BY_NUMBER_AND_TYPE("Заявка за извличане на електронни идентичности по номер и тип", "Успешно извличане на електронни идентичности по номер и тип", "Неуспешно извличане на електронни идентичности по номер и тип", true),
	GET_EIDENTITIES_BY_FIELD("Заявка за извличане на електронни идентичности по номер и тип, по профил на гражданина или мейл", "Успешно извличане на електронни идентичности по номер и тип, по профил или по мейл на гражданина", "Неуспешно извличане на електронни идентичности по номер и тип, по профил или по мейл на гражданина", true),
	CREATE_TARIFF("Заявка за създаване на тарифа", "Успешно създаване на тарифа", "Неуспешно създаване на тарифа", true),
	UPDATE_TARIFF("Заявка за промяна на тарифа", "Успешна промяна на тарифа", "Неуспешна промяна на тарифа", true),
	DELETE_TARIFF("Заявка за изтриване на тарифа", "Успешно изтриване на тарифа", "Неуспешно изтриване на тарифа", true),
	GET_ALL_TARIFFS_BY_EID_ADMINISTRATOR_ID("Заявка за извличане на всички тарифи по ID на администратор", "Успешно извличане на всички тарифи по ID на администратор", "Неуспешно извличане на всички тарифи по ID на администратор", false),
	GET_TARIFF_BY_DATE("Заявка за извличане на тарифа по дата", "Успешно извличане на тарифа по дата", "Неуспешно извличане на тарифа по дата", false),
	GET_TARIFF_BY_ID("Заявка за извличане на тарифа по ID", "Успешно извличане на тарифа по ID", "Неуспешно извличане на тарифа по ID", true),
	CREATE_DISCOUNT("Заявка за създаване на отстъпка", "Успешно създаване на отстъпка", "Неуспешно създаване на отстъпка", true),
	GET_ALL_DISCOUNTS_BY_EID_ADMINISTRATOR_ID("Заявка за извличане на всички отстъпки по ID на администратор", "Успешно извличане на всички отстъпки по ID на администратор", "Неуспешно извличане на всички отстъпки по ID на администратор", false),
	GET_DISCOUNT_BY_DATE("Заявка за извличане на отстъпка по дата", "Успешно извличане на отстъпка по дата", "Неуспешно извличане на отстъпка по дата", false),
	GET_DISCOUNT_BY_ID("Заявка за извличане на отстъпка по ID", "Успешно извличане на отстъпка по ID", "Неуспешно извличане на отстъпка по ID", true),
	UPDATE_DISCOUNT("Заявка за промяна на отстъпка", "Успешна промяна на отстъпка", "Неуспешна промяна на отстъпка", true),
	DELETE_DISCOUNT("Заявка за изтриване на отстъпка", "Успешно изтриване на отстъпка", "Неуспешно изтриване на отстъпка", true),
	CREATE_DEVICE_TARIFF("Заявка за създаване на тарифа за носител", "Успешно създаване на тарифа за носител", "Неуспешно създаване на тарифа за носител", true),
	GET_ALL_DEVICE_TARIFFS_BY_EID_ADMINISTRATOR_ID("Заявка за извличане на всички тарифи за устройства по ID на администратор", "Успешно извличане на всички тарифи за устройства по ID на администратор", "Неуспешно извличане на всички тарифи за устройства по ID на администратор", false),
	GET_DEVICE_TARIFF_BY_DATE("Заявка за извличане на тарифа за носител по дата", "Успешно извличане на тарифа за носител по дата", "Неуспешно извличане на тарифа за носител по дата", false),
	CALCULATE_TARIFF("Заявка за изчисляване на тарифа", "Успешно изчисляване на тарифа", "Неуспешно изчисляване на тарифа", false),
	NAIF_UPDATE_CERTIFICATE_STATUS("Заявка за актуализиране на статус на Удостоверение за електронна идентичност чрез НАИФ", "Успешно актуализиране на статус на Удостоверение за електронна идентичност чрез НАИФ", "Неуспешно актуализиране на статус на Удостоверение за електронна идентичност чрез НАИФ", true),
	UPDATE_CITIZEN_PROFILE_EMAIL("Заявка за актуализиране на имейл на профил на гражданин", "Успешно актуализиране на имейл на профил на гражданин", "Неуспешно актуализиране на имейл на профил на гражданин", true),
	CONFIRM_UPDATE_CITIZEN_PROFILE_EMAIL("Заявка за потвърждаване на актуализация на имейл на профил на гражданин", "Успешно потвърждаване на актуализация на имейл на профил на гражданин", "Неуспешно потвърждаване на актуализация на имейл на профил на гражданин", true),
	ACTIVATE_DELIVERED_CERTIFICATE_BY_NAIF("Заявка за активиране на доставен Удостоверение за електронна идентичност чрез НАИФ", "Успешно активиране на доставен Удостоверение за електронна идентичност чрез НАИФ", "Неуспешно активиране на доставен Удостоверение за електронна идентичност чрез НАИФ", true),
	INVALIDATE_CITIZEN_EID_BY_NAIF("Заявка за анулиране на електронна идентичност на гражданин чрез НАИФ", "Успешно анулиране на електронна идентичност на гражданин чрез НАИФ", "Неуспешно анулиране на електронна идентичност на гражданин чрез НАИФ", true),
	UPDATE_CITIZEN_IDENTIFIER_BY_NAIF("Заявка за актуализиране на идентификатор на гражданин чрез НАИФ", "Успешно актуализиране на идентификатор на гражданин чрез НАИФ", "Неуспешно актуализиране на идентификатор на гражданин чрез НАИФ", true),
	GET_DEVICES_BY_TYPE("Заявка за извличане на носители по тип", "Успешно извличане на носители по тип", "Неуспешно извличане на носители по тип", false),
	APPLICATION_REPORT_TOTAL("Заявка за извличане на общ отчет за заявленията", "Успешно извличане на общ отчет за заявленията", "Неуспешно извличане на общ отчет за заявленията", true),
	APPLICATION_REPORT_BY_REGION("Заявка за извличане на отчет за заявленията по регион", "Успешно извличане на отчет за заявленията по регион", "Неуспешно извличане на отчет за заявленията по регион", true),
	APPLICATION_REPORT_BY_ADMINISTRATOR("Заявка за извличане на отчет за заявленията по администратор", "Успешно извличане на отчет за заявленията по администратор", "Неуспешно извличане на отчет за заявленията по администратор", true),
	APPLICATION_REPORT_BY_OPERATORS("Заявка за извличане на отчет за заявленията по оператори", "Успешно извличане на отчет за заявленията по оператори", "Неуспешно извличане на отчет за заявленията по оператори", true),
	REPORT_OF_EID_ADMINISTRATORS("Заявка за извличане на отчет за администратори", "Успешно извличане на отчет за администратори", "Неуспешно извличане на отчет за администратори", true),
	REPORT_OF_EID_CENTERS("Заявка за извличане на отчет за центрове", "Успешно извличане на отчет за центрове", "Неуспешно извличане на отчет за центрове", true),
//	FIND_DAILY_EXPIRING_CERTIFICATES("Заявка за намиране на изтичащи Удостоверения за електронна идентичност (автоматична проверка)", "Успешно намиране на изтичащи Удостоверения за електронна идентичности (автоматична проверка)", "Неуспешно намиране на изтичащи Удостоверения за електронна идентичности (автоматична проверка)", true),
	NAIF_GET_DEVICE_HISTORY("Заявка за извличане на историята на носител чрез НАИФ", "Успешно извличане на историята на носител чрез НАИФ", "Неуспешно извличане на историята на носител чрез НАИФ", true),
	GET_DEVICE_PUK("Заявка за извличане на PUK код за носител", "Успешно извличане на PUK код за носител", "Неуспешно извличане на PUK код за носител", true),
	CREATE_HELP_PAGE("Заявка за създаване на помощна страница", "Успешно създаване на помощна страница", "Неуспешно създаване на помощна страница", true),
	FIND_HELP_PAGES("Заявка за намиране на помощни страници", "Успешно намиране на помощни страници", "Неуспешно намиране на помощни страници", false),
	UPDATE_HELP_PAGE("Заявка за обновяване на помощна страница", "Успешно обновяване на помощна страница", "Неуспешно обновяване на помощна страница", false),
	DELETE_HELP_PAGE("Заявка за изтриване на помощна страница", "Успешно изтриване на помощна страница", "Неуспешно изтриване на помощна страница", false),
	DELETE_DOCUMENT("Заявка за изтриване на прикачен документ", "Успешно изтриване на прикачен документ", "Неуспешно изтриване на прикачен документ", true),
	GET_DOCUMENT_BY_ID("Заявка за извличане на прикачен документ по ID", "Успешно извличане на прикачен документ по ID", "Неуспешно извличане на прикачен документ по ID", true),
	GET_TECHNICAL_CHECK_PROTOCOL("Заявка за извличане на Протокол за техническа свързаност", "Успешно извличане на Протокол за техническа свързаност", "Неуспешно извличане на Протокол за техническа свързаност", true),
	CREATE_DOCUMENT("Заявка за прикачване на документ", "Успешно прикачване на документ", "Неуспешно прикачване на документ", true),
	CREATE_EXT_DOCUMENT("Заявка за прикачване на документ", "Успешно прикачване на документ", "Неуспешно прикачване на документ", true),
	GET_HELP_PAGE_BY_ID("Заявка за извличане на помощна страница по ID", "Успешно извличане на помощна страница по ID", "Неуспешно извличане на помощна страница по ID", false),
	GET_HELP_PAGE_BY_PAGE_NAME("Заявка за извличане на помощна страница по име на страница", "Успешно извличане на помощна страница по име на страница", "Неуспешно извличане на помощна страница по име на страница", false),
	CHANGE_APPLICATION_STATUS("Заявка за смяна на статус на заявление", "Успешно смяна на статус на заявление", "Неуспешно смяна на статус на заявление", true),
	CHANGE_EXT_APPLICATION_STATUS("Заявка за смяна на статус на заявление", "Успешно смяна на статус на заявление", "Неуспешно смяна на статус на заявление", true),
	CHANGE_EID_MANAGER_STATUS("Заявка за смяна на статус на мениджър", "Успешно смяна на статус на мениджър", "Неуспешно смяна на статус на мениджър", true),
	CHECK_CODE("Заявка за проверка на код на мениджър/офис", "Успешна проверка на код на мениджър/офис", "Неуспешна проверка на код на мениджър/офис", true),

	//Document Type
	CREATE_DOCUMENT_TYPE("Заявка за създаване на нов тип документ", "Успешно създаване на нов тип документ", "Неуспешно създаване на нов тип документ", true),
	UPDATE_DOCUMENT_TYPE("Заявка за промяна на тип документ", "Успешна промяна на тип документ", "Неуспешна промяна на тип документ", true),
	DELETE_DOCUMENT_TYPE("Заявка за изтриване на тип документ", "Успешно изтриване на тип документ", "Неуспешно изтриване на тип документ", true),
	GET_DOCUMENT_TYPE("Заявка за извличане на тип документ", "Успешно извличане на тип документ", "Неуспешно извличане на тип документ", true),
	LIST_DOCUMENT_TYPE("Заявка за извличане на списък с тип документ", "Успешно извличане на списък с тип документ", "Неуспешно извличане на списък с тип документ", true),

	//EMPLOYEE
	CHEK_AIE_EMPLOYEE("Заявка за проверка на служител на Администратор на електронна идентичност", "Успешна проверка на служител на Администратор на електронна идентичност", "Неуспешна проверка на служител на Администратор на електронна идентичност", true),
	CHEK_CEI_EMPLOYEE("Заявка за проверка на служител на Център за електронна идентификация", "Успешна проверка на служител на Център за електронна идентификация", "Неуспешна проверка на служител на Център за електронна идентификация", true),
	GET_ALL_EMPLOYEE_BY_SYSTEM_ID("Заявка за извличане на всички служители на регистриран АЕИ или ЦЕИ", "Успешно извличане на всички служители на регистриран АЕИ или ЦЕИ", "Неуспешно извличане на всички служители на регистриран АЕИ или ЦЕИ", true),
	CREATE_EMPLOYEE("Заявка за създаване на служител", "Успешно създаване на служител", "Неуспешно създаване на служител", true),
	CREATE_AUTHORIZED_PERSON("Заявка за създаване на упълномощен", "Успешно създаване на упълномощен", "Неуспешно създаване на упълномощен", true),
	GET_EMPLOYEE_BY_ID("Заявка за извличане на служител по ID", "Успешно извличане на служител по ID", "Неуспешно извличане на служител по ID", true),
	GET_AUTHORIZED_PERSON_BY_ID("Заявка за извличане на упълномощен по ID", "Успешно извличане на упълномощен по ID", "Неуспешно извличане на упълномощен по ID", true),
	UPDATE_EMPLOYEE("Заявка за промяна на служител", "Успешна промяна на служител", "Неуспешна промяна на служител", true),
	UPDATE_AUTHORIZED_PERSON("Заявка за промяна на упълномощен", "Успешна промяна на упълномощен", "Неуспешна промяна на упълномощен", true),
	DELETE_EMPLOYEE("Заявка за изтриване на служител", "Успешно изтриване на служител", "Неуспешно изтриване на служител", true),
	DELETE_AUTHORIZED_PERSON("Заявка за изтриване на упълномощен", "Успешно изтриване на упълномощен", "Неуспешно изтриване на упълномощен", true),

	//REGION
	GET_ALL_REGIONS("Заявка за извличане на всички региони", "Успешно извличане на всички региони", "Неуспешно извличане на всички региони", true),

	//Middleware
	ONLINE_SUCCESSFUL_PIN_CHANGE("Заявка за записване в журнала на успешна промяна на PIN онлайн", "Успешно записване в журнала на успешна промяна на PIN онлайн", "Неуспешно записване в журнала на успешна промяна на PIN онлайн", true),
	ONLINE_UNSUCCESSFUL_PIN_CHANGE("Заявка записване в журнала на за неуспешна промяна на PIN онлайн", "Успешно записване в журнала на неуспешна промяна на PIN онлайн", "Неуспешно записване в журнала на неуспешна промяна на PIN онлайн", true),
	DESK_ENTER_PIN("Заявка за въвеждане на PIN на гише", "Успешно въвеждане на PIN на гише", "Неуспешно въвеждане на PIN на гише", true),
	DESK_CHANGE_PIN("Заявка за промяна на PIN на гише", "Успешна промяна на PIN на гише", "Неуспешна промяна на PIN на гише", true),
	DESK_ACTIVATE_PIN("Заявка за активиране на PIN на гише", "Успешно активиране на PIN на гише", "Неуспешно активиране на PIN на гише", true),
	DESK_UPDATE_CERTIFICATE("Заявка за смяна на Удостоверение за електронна идентичност на гише", "Успешна смяна на Удостоверение за електронна идентичност на гише", "Неуспешна смяна на Удостоверение за електронна идентичност на гише", true),

	UPDATE_CERTIFICATE_ALIAS("Заявка за актуализиране на псевдоним на Удостоверение за електронна идентичност", "Успешно актуализиране на псевдоним на Удостоверение за електронна идентичност", "Неуспешно актуализиране на псевдоним на Удостоверение за електронна идентичност", true),
	PUBLIC_FIND_CERTIFICATES_INFO("Заявка за публично намиране на информация за Удостоверения за електронна идентичности", "Успешно публично намиране на информация за Удостоверения за електронна идентичност", "Неуспешно публично намиране на информация за Удостоверения за електронна идентичности", true),
	GET_PAYMENT_BY_ID("Заявка за извличане на плащане по ID", "Успешно извличане на плащане по ID", "Неуспешно извличане на плащане по ID", true),
	GET_ALL_PAYMENTS("Заявка за извличане на всички плащания", "Успешно извличане на всички плащания", "Неуспешно извличане на всички плащания", true),
	
	//MPOZEI SchedulerService.java
	DAILY_UNFINISHED_APPLICATIONS("Заявка за прекратяване на изтекло заявление [автоматичен процес]", "Успешно прекратяване на изтекло заявление [автоматичен процес]", "Неуспешно прекратяване на изтекло заявление [автоматичен процес]", true),
	DAILY_EXPIRING_CERTIFICATE("Заявка за прекратяване на изтекло удостоверение [автоматичен процес]", "Успешно прекратяване на изтекло удостоверение [автоматичен процес]", "Неуспешно прекратяване на изтекло удостоверение [автоматичен процес]", true),
	INVALIDATE_CERTIFICATE_DECEASED_CITIZEN("Заявка за прекратяване на удостоверение, починал гражданин [автоматичен процес]", "Успешно прекратяване на удостоверение, починал гражданин [автоматичен процес]", "Неуспешно прекратяване на удостоверение, починал гражданин [автоматичен процес]", true),
	INVALIDATE_EIDENTITY_ID_DECEASED_CITIZEN("Заявка за прекратяване на електронна идентичност, починал гражданин [автоматичен процес]", "Успешно прекратяване на електронна идентичност, починал гражданин [автоматичен процес]", "Неуспешно прекратяване на електронна идентичност, починал гражданин [автоматичен процес]", true),
	INVALIDATE_PROFILE_DECEASED_CITIZEN("Заявка за прекратяване на профил, починал гражданин [автоматичен процес]", "Успешно прекратяване на профил, починал гражданин [автоматичен процес]", "Неуспешно прекратяване на профил, починал гражданин [автоматичен процес]", true),
	UPDATE_APPLICATION_PAYMENT_STATUS("Заявка за смяна на платежен статус на заявление [автоматичен процес]", "Успешна смяна на платежен статус на заявление [автоматичен процес]", "Неуспешна смяна на платежен статус на заявление [автоматичен процес]", true),
	
	//ISCEI
	APPROVAL_REQUEST_AUTH("Заявка за автентикация с чакаща заявка", "Успешна автентикация с чакаща заявка", "Неуспешна автентикация с чакаща заявка", true),
	APPROVAL_REQUEST_OUTCOME("Заявка за резултат от чакаща заявка", "Успешен резултат от чакаща заявка", "Неуспешен резултат от чакаща заявка", true),
	APPROVAL_REQUEST_TOKEN("Заявка за токен за чакаща заявка", "Успешен токен за чакаща заявка", "Неуспешен токен за чакаща заявка", true),
	AUTH_BASIC("Заявка за автентикация с потребителско име и парола", "Успешна автентикация с потребителско име и парола", "Неуспешна автентикация с потребителско име и парола", true),
	AUTH_MOBILE_X509_CERTIFICATE("Заявка за автентикация с удостоверение за електронна идентичност на мобилно приложение", "Успешна автентикация с удостоверение за електронна идентичност на мобилно приложение", "Неуспешна автентикация с удостоверение за електронна идентичност на мобилно приложение", true),
	AUTH_ONLINE_X509_CERTIFICATE("Заявка за онлайн автентикация с удостоверение за електронна идентичност", "Успешна онлайн автентикация с удостоверение за електронна идентичност", "Неуспешна онлайн автентикация с удостоверение за електронна идентичност", true),
	AUTH_TOKEN("Заявка за извличане на токен", "Успешно извличане на токен", "Неуспешно извличане на токен", true),
	ASSOCIATE_PROFILES("Заявка за присъединяване на базов профил с електронна идентичност", "Успешно присъединяване на базов профил с електронна идентичност", "Неуспешно присъединяване на базов профил с електронна идентичност", true)
    ;

    public static final String AUDIT_EVENT_TYPE_KEY = "AUDIT_EVENT_TYPE";
    
	private String requestMessageCyrillic;
	private String successMessageCyrillic;
	private String failMessageCyrillic;
	private boolean isEnabled;
	
	AuditEventType(String requestMessageCyrillic,String successMessageCyrillic, String failMessageCyrillic, boolean isEnabled) {
	  this.requestMessageCyrillic = requestMessageCyrillic;
	  this.successMessageCyrillic = successMessageCyrillic;
	  this.failMessageCyrillic = failMessageCyrillic;
	  this.isEnabled = isEnabled;
	}

	/**
	 * @return the requestMessageCyrillic
	 */
	public String getRequestMessageCyrillic() {
		return requestMessageCyrillic;
	}

	/**
	 * @return the successMessageCyrillic
	 */
	public String getSuccessMessageCyrillic() {
		return successMessageCyrillic;
	}

	/**
	 * @return the failMessageCyrillic
	 */
	public String getFailMessageCyrillic() {
		return failMessageCyrillic;
	}

	/**
	 * @return the isEnabled
	 */
	public boolean getIsEnabled() {
		return isEnabled;
	}
}
